DeviceProcessEvents
| where (ProcessCommandLine has "-EncodedCommand" or ProcessCommandLine has "-enc " or ProcessCommandLine has "-ec ")
| project TimeGenerated, DeviceName, FolderPath, ProcessCommandLine,
          InitiatingProcessFolderPath, AccountName
| order by TimeGenerated desc
